/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "Valittua sisältöä ei voitu toistaa.";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "Sisältöä ei löytynyt.";

/* kBRMediaPlayerSongPlaybackError*/
201 = "Nykyistä kappaletta ei voida toistaa.";


/* kBRMediaNoContent*/
300 = "Sisältöä ei löytynyt.";

/* kBRMediaNoPhotoContent */
301 = "iPhoto-kirjastossa ei ole valokuvia.";

/* kBRMediaNoPodcastContent */
302 = "iTunes-kirjastossa ei ole podcasteja.";

/* kBRMediaNotDRMAuthorized */
303 = "Sinua ei ole valtuutettu toistamaan tätä sisältöä.";

/* kBRMediaNoMovieFolderContent */
304 = "Elokuvat-kansiossa ei ole toistettavia elokuvia.";

/* kBRMediaNoTVShowContent */
305 = "iTunes-kirjastossa ei ole tv-ohjelmia.";

/* kBRMediaNoMusicVideoContent */
306 = "iTunes-kirjastossa ei ole musiikkivideoita.";

/* kBRMediaNoPlaylists */
307 = "iTunes-kirjastossa ei ole soittolistoja.";

/* kBRMediaNoSongContent */
308 = "iTunes-kirjastossa ei ole kappaleita.";

/* kBRMediaNoAudioBookContent */
309 = "iTunes-kirjastossa ei ole äänikirjoja.";

/* kBRMediaEmptyPlaylist */
310 = "Soittolistassa ei ole kappaleita.";

/* kBRMediaNoSuchPlaylist */
311 = "Valittua soittolistaa ei löytynyt.";

/* kBRMediaNoSuchSong */
312 = "Valittua kappaletta ei löytynyt.";

/* kBRMediaNoMovies */
315 = "Elokuvat-kansiossa ei ole elokuvia.";

/* kBRMediaNoSongForSlideshow */
316 = "Kuvaesityksen kappaletta ei voitu toistaa.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "Kuvaesityksen kappaletta ei voitu toistaa.";

/* kBRVideoUnplayable */
318 = "Valittua videota ei voida toistaa.";

/* kBRMediaRadioStreamUnplayable */
319 = "Valittua radiolähetystä ei voitu toistaa.";

/* kBRRemoteMediaNoContent*/
350 = "Kirjastosta ei löytynyt sisältöä.";

/* kBRRemoteMediaNoPhotoContent */
351 = "Kirjastossa ei ole valokuvia.";

/* kBRRemoteMediaNoPodcastContent */
352 = "Kirjastossa ei ole podcasteja.";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "Sinua ei ole valtuutettu toistamaan tätä sisältöä.";

/* kBRRemoteMediaNoTVShowContent */
355 = "Kirjastossa ei ole tv-ohjelmia.";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "Kirjastossa ei ole musiikkivideoita.";

/* kBRRemoteMediaNoPlaylists */
357 = "Kirjastossa ei ole soittolistoja.";

/* kBRRemoteMediaNoSongContent */
358 = "Kirjastossa ei ole kappaleita.";

/* kBRRemoteMediaNoAudioBookContent */
359 = "Kirjastossa ei ole äänikirjoja.";

/* kBRRemoteMediaEmptyPlaylist */
360 = "Soittolistassa ei ole kappaleita.";

/* kBRRemoteMediaLoadingError */
361 = "Ladattaessa sisältöä tapahtui virhe.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "Valokuvien jakolähde ei ole käytettävissä.";

/* kBRDataSourceInitializationFailure*/
400 = "Sisältöä ei löytynyt.";

/* kBRDataSourceURLResolutionFailure*/
410 = "Sisältöä ei löytynyt.";

/* kBRDataSourceConnectionInProgressError */
420 = "Yritetään jo yhdistää tähän lähteeseen.";


/* KBRSystemNetworkHostUnreachable */
501 = "Tähän kirjastoon ei voida yhdistää.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "Elokuvaesittelyä ei voida toistaa tällä hetkellä.";

/* kBRSystemNotHDCPCompliant */
503 = "Tämän sisällön toistoon vaaditaan HDCP.";

/* kBRSetupCantSetLanguage */
600 = "Kieltä ei voitu vaihtaa.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "DVD:tä ei voida toistaa tällä hetkellä.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "DVD:tä ei voida poistaa asemasta.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "DVD:n aluekoodi ei vastaa DVD-soittimen koodia.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "DVD:tä ei voida toistaa.";

/* kBRDVDErrorFatalDVDAlert */
754 = "DVD:tä ei voida toistaa.";

/* kBRCDErrorCantEjectCDAlert */
755 = "CD:tä ei voida poistaa asemasta.";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "Levyn kopiosuojausta ei voida varmistaa.";

/* kBRInternalResourceError */
900 = "Tapahtui virhe.";

